export default {
  fullName: "アジュラン ジャラル",
  position: "熱烈なソフトウェアエンジニア",
  summary: "コーディング、デバッグ、優雅な解決策の追求に全力を注いでいます。",
  about: "について",
  experience: "経験",
  projects: "プロジェクト",
  aboutDescription:
    "若い頃から、私は常にコーディングへの情熱を抱き、それはインターネットの動作の不思議さから生まれていました。以前はHTMLとCSSを使って独自のGoogleブログテンプレートで遊んでいて、それは本当に楽しかったです。時が経ち、今日に至って、私はその情熱を本格的なソフトウェアの制作で成功に結びつけました。<br /><br />私は<b>ソフトウェアエンジニアリングの学位</b>を持ち、<b>1.4年の実務経験</b>を通して、頑健で高品質なソフトウェアの構築とビジネスの課題解決に焦点を当ててきました。使用したプログラミング言語には, <b>JavaScript、Java、Dart、およびPHP</b>などが含まれます。<br /><br />コンピューターから離れていると、ジムで過ごしたり、兄と遊んだり、本を読んでいる姿が見られるでしょう。",
};
