export default {
  fullName: "アジュラン ジャラル",
  position: "熱烈なソフトウェアエンジニア",
  summary: "コーディング、デバッグ、優雅な解決策の追求に全力を注いでいます。",
  about: "について",
  experience: "経験",
  projects: "プロジェクト",
  aboutDescription:
    "若い頃から、私は常にコーディングへの情熱を抱き、それはインターネットの動作の不思議さから生まれていました。以前はHTMLとCSSを使って独自のGoogleブログテンプレートで遊んでいて、それは本当に楽しかったです。時が経ち、今日に至って、私はその情熱を本格的なソフトウェアの制作で成功に結びつけました。<br /><br />私は<b>ソフトウェアエンジニアリングの学位</b>を持ち、<b>1.4年の実務経験</b>を通して、頑健で高品質なソフトウェアの構築とビジネスの課題解決に焦点を当ててきました。使用したプログラミング言語には, <b>JavaScript、Java、Dart、およびPHP</b>などが含まれます。<br /><br />コンピューターから離れていると、ジムで過ごしたり、兄と遊んだり、本を読んでいる姿が見られるでしょう。",
  startDate1: "2023年3月",
  endDate1: "2023年11月",
  position1: "ソフトウェアエンジニア",
  company1: "フアコム",
  description1:
    "e-請求やリアルタイムチャットシステムを含む複雑なソフトウェア機能を開発しました。ReactベースのWebアプリケーションを最適化し、パフォーマンスが50％向上し、ユーザーエクスペリエンスが向上しました。顧客の要件を収集し、システムトレーニングを実施し、継続的な顧客サポートを提供しました。オープンな対話と知識共有を通じて他のエンジニアとの密な連携を確保しました。本番での重要なソフトウェアのバグを特定および解決しました。",
  startDate2: "2022年8月",
  endDate2: "2023年2月",
  position2: "ソフトウェアエンジニアインター",
  company2: "フアコム",
  description2:
    "Flutterを使用してAndroidおよびiOS向けにProConnectモバイルアプリを開発および維持しました。ProConnectで反復的な改善を実施してシームレスなユーザーエクスペリエンスを実現しました。ProConnectの機能を監督し、機能の拡張を提案しました。クリーンアーキテクチャを実装してコードの品質と保守性を確保しました。",

  projectName1: "リアルタイムビデオ会議アプリ",
  projectDescription1:
    "WebRTCとSocket.ioの力を活用してビデオチャットアプリを構築しました。アプリの機能には、他の人とミーティングを開催できる能力、招待リンクを使用して他の人をホストされたルームに招待できる能力、およびビデオルームでリアルタイムメッセージを書く能力が含まれています。",
  projectName2: "Khairukウェブサイト",
  projectDescription2:
    "このランディングページは、WordPressとHTML、CSS、JavaScript、およびjQueryを含むテックスタックを使用してNGO組織のために開発されました。サイトにはGoogle SheetsとジオコーディングAPIとの統合も含まれています。",
  projectName3: "Servicify Web App",
  projectDescription3:
    "Servicifyはサービス交換プラットフォームで、誰でも自分のニーズを投稿したり、オペレーションのためにサービスプロバイダーをリクエストしたりできます。 サービスプロバイダーは、クライアントのニーズに競争力のある価格でソリューションを提案することができ、最終的には顧客がどの提案が最も要件に合っているかを決定し、それに従って進めることができます。 これはWebアプリのバージョンです。",
  projectName4: "ポートフォリオWebアプリ",
  projectDescription4:
    "私の多様な仕事のショーケースとして機能する、私のスキル、成果、および取り組みに対する包括的なガイドを提供するために、まったく新しいポートフォリオウェブサイトが開発されました。",

  website: "ウェブサイト",
  githubRepository: "GitHubリポジトリ",
  builtWith: "で構築されました",
  andDeployedWith: "およびデプロイされました",
};
